package chapter07_;

public class Promotion {
	public static void main(String[] args) {
		/*
		 * 타입변환과 다형성
		 * 
		 * 부모타입과 자식타입이 있을때 
		 * 부모타입은 자식타입으로 바꾸기 어렵다
		 * 반대로 자식타입은 부모타입으로 변하기 쉬움
		 * 
		 * 자식타입으로 만든 변수는 부모타입 변수가 자동으로 타입변환
		 * 
		 * 다형성 多形性
		 * 사용방법은 동일하지만 다양한 객체를 이용해 다양한 실행결과가 나오도록 하는 성질
		 * 
		 * 하나의 부모클래스가 있을때 자식클래스들을 다양하게 만들 수 있다
		 * 
		 * =>구현할려면 메소드 재정이와 타입변환 필요
		 * 
		 * 자동타입변환
		 * =>자식은 부모의 특징과 기능을 상속받기 때문에 부모와 동일하게 취급받을 수 있다.
		 * 
		 * 객체를 선언할때 타입은 생성한 타입이랑 같은 타입이거나 상위 타입(부보테이블) 선언
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 */
	}

}
